// @strict-types

#Область ОбработчикиСобытий

// Обработка команды.
// 
// Параметры:
//  ПараметрКоманды - СправочникСсылка.УПО_ВерсииПлатформенныхОбработок
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды - Параметры выполнения команды
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УникальноеИмя = "UPO_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	УПО_ВызовСервера.ПодключитьВерсиюОбработки(ПараметрКоманды, УникальноеИмя);
	
	ОткрытьФорму(СтрШаблон("ВнешняяОбработка.%1.Форма", УникальноеИмя));
	
КонецПроцедуры

#КонецОбласти
