
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
    Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПолныеПути();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПолныеПути()
	
	Для каждого ТекущиеДанные Из ИменаПодключения Цикл
		ТекущиеДанные.ПолныйПуть = СтрШаблон(
			"v8res://mngbase/%1.epf", ТекущиеДанные.КлючевоеИмя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли