// @strict-types

#Область ПрограммныйИнтерфейс

// Обновить платформенные обработки.
// 
// Параметры:
//  ТолькоПриСменеВерсииПриложения - Булево
Процедура ОбновитьПлатформенныеОбработки(ТолькоПриСменеВерсииПриложения = Ложь) Экспорт
	
	ВерсияПриложения = УправлениеПлатформеннымиОбработкамиКлиентСервер.ВерсияПриложения();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВерсияПриложения", ВерсияПриложения);
	
	Если ТолькоПриСменеВерсииПриложения Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ РегистрСведений.ОбновленныеВерсииПриложения ГДЕ ВерсияПриложения = &ВерсияПриложения";
		Если Запрос.Выполнить().Пустой() Тогда
			ТекстСообщения = СтрШаблон("Обновление платформенны обработок для версии приложения %1", ВерсияПриложения);
			УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Справочники.ПлатформенныеОбработки.ЗаполнитьЭталонныеДанные();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлатформенныеОбработки.Ссылка КАК Обработка,
	|	ИменаПодключенияОбработки.ПолныйПуть КАК ПолныйПуть,
	|	ИменаПодключенияОбработки.КлючевоеИмя КАК КлючевоеИмя
	|ИЗ
	|	Справочник.ПлатформенныеОбработки КАК ПлатформенныеОбработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииПлатформенныхОбработок КАК ВерсииПлатформенныхОбработок
	|		ПО ПлатформенныеОбработки.Ссылка = ВерсииПлатформенныхОбработок.Владелец
	|			И (ВерсииПлатформенныхОбработок.Родитель = ЗНАЧЕНИЕ(Справочник.ВерсииПлатформенныхОбработок.ПустаяСсылка))
	|			И (ВерсииПлатформенныхОбработок.ВерсияПриложения = &ВерсияПриложения)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПлатформенныеОбработки.ИменаПодключения КАК ИменаПодключенияОбработки
	|		ПО ПлатформенныеОбработки.Ссылка = ИменаПодключенияОбработки.Ссылка
	|ГДЕ
	|	ВерсииПлатформенныхОбработок.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СоздатьВерсиюОбработки(Выборка, ВерсияПриложения);
		КонецЦикла;
	КонецЕсли;
	
	ОбновленнаяВерсия = РегистрыСведений.ОбновленныеВерсииПриложения.СоздатьМенеджерЗаписи();
	ОбновленнаяВерсия.ВерсияПриложения = ВерсияПриложения;
	ОбновленнаяВерсия.ДатаОбновления   = ТекущаяДатаСеанса();
	ОбновленнаяВерсия.Записать(Истина);
	
КонецПроцедуры

// Подменить платформенные обработки перед запуском системы.
Процедура ПодменитьПлатформенныеОбработкиПередЗапускомСистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодменаПлатформенныхОбработок.Владелец КАК Владелец,
	|	ПодменаПлатформенныхОбработок.Обработка КАК Обработка,
	|	ПодменаПлатформенныхОбработок.Использование КАК Использование,
	|	ПодменаПлатформенныхОбработок.ВерсияОбработки КАК ВерсияОбработки,
	|	ПодменаПлатформенныхОбработок.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ПодменаПлатформенныхОбработок.Владелец = &ИдентификаторТекущегоПользователяИБ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ПодменыОбработок
	|ИЗ
	|	РегистрСведений.ПодменаПлатформенныхОбработок КАК ПодменаПлатформенныхОбработок
	|ГДЕ
	|	ПодменаПлатформенныхОбработок.Владелец В (&ИдентификаторТекущегоПользователяИБ, &ПустойУникальныйИдентификатор)
	|	И ПодменаПлатформенныхОбработок.Использование = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИменаПодключения.КлючевоеИмя КАК КлючевоеИмя,
	|	ПодменыОбработок.ВерсияОбработки КАК ВерсияОбработки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПодменыОбработок.Обработка КАК Обработка,
	|		МАКСИМУМ(ПодменыОбработок.Приоритет) КАК Приоритет
	|	ИЗ
	|		ПодменыОбработок КАК ПодменыОбработок
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПодменыОбработок.Обработка) КАК МаксимальныйПриоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодменыОбработок КАК ПодменыОбработок
	|		ПО МаксимальныйПриоритет.Обработка = ПодменыОбработок.Обработка
	|			И МаксимальныйПриоритет.Приоритет = ПодменыОбработок.Приоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПлатформенныеОбработки.ИменаПодключения КАК ИменаПодключения
	|		ПО МаксимальныйПриоритет.Обработка = ИменаПодключения.Ссылка";	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторТекущегоПользователяИБ", ИдентификаторТекущегоПользователяИБ());
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ПустойУникальныйИдентификатор());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВерсияОбработки = Выборка.ВерсияОбработки; //СправочникСсылка.ВерсииПлатформенныхОбработок
			КлючевоеИмя = Выборка.КлючевоеИмя; //Строка
			ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя);			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Подключить версию обработки.
// 
// Параметры:
//  ВерсияОбработки - СправочникСсылка.ВерсииПлатформенныхОбработок
//  КлючевоеИмя - Строка
Процедура ПодключитьВерсиюОбработки(ВерсияОбработки, Знач КлючевоеИмя = "") Экспорт
	
	Если ПустаяСтрока(КлючевоеИмя) Тогда
		КлючевоеИмя = ЗначениеРеквизитаОбъекта(ВерсияОбработки, "КлючевоеИмя", ""); //Строка
	КонецЕсли;
	
	СсылкаНаДанные = ПолучитьНавигационнуюСсылку(ВерсияОбработки, "ДанныеВерсии");
	
	ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	ВнешниеОбработки.Подключить(СсылкаНаДанные, КлючевоеИмя, Ложь, ОписаниеЗащиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обновить платформенные обработки при смене версии приложения.
Процедура ОбновитьПлатформенныеОбработкиПриСменеВерсииПриложения() Экспорт

	ОбновитьПлатформенныеОбработки(Истина);
	
КонецПроцедуры

// Двоичные данные версии.
// 
// Параметры:
//  Версия - СправочникСсылка.ВерсииПлатформенныхОбработок
// 
// Возвращаемое значение:
//  ДвоичныеДанные, Неопределено -
Функция ДвоичныеДанныеВерсии(Версия) Экспорт
	
	ДанныеВерсии = ЗначениеРеквизитаОбъекта(Версия, "ДанныеВерсии");
	Если ТипЗнч(ДанныеВерсии) = Тип("ХранилищеЗначения") Тогда
		Возврат ДанныеВерсии.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Это оригинальная версия.
// 
// Параметры:
//  Версия - СправочникСсылка.ВерсииПлатформенныхОбработок
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоОригинальнаяВерсия(Версия) Экспорт
	
	Возврат НЕ ЗначениеЗаполнено(ЗначениеРеквизитаОбъекта(Версия, "Родитель"));
	
КонецФункции

// Удалить все данные подсистемы.
Процедура УдалитьВсеДанныеПодсистемы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ПлатформенныеОбработки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ВерсииПлатформенныхОбработок";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекущаяСсылка = Выборка.Ссылка;//СправочникСсылка
			ТекущийОбъект = ТекущаяСсылка.ПолучитьОбъект();
			ТекущийОбъект.ОбменДанными.Загрузка = Истина;
			ТекущийОбъект.Удалить();
			
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПодменаПлатформенныхОбработок.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Идентификатор текущего пользователя ИБ.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор
Функция ИдентификаторТекущегоПользователяИБ() Экспорт
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ТекущийПользователь = Неопределено Тогда
		Возврат ПустойУникальныйИдентификатор();
	Иначе
		Возврат ТекущийПользователь.УникальныйИдентификатор;
	КонецЕсли;
	
КонецФункции

// Представление пользователя ИБ.
// 
// Параметры:
//  ИдентификаторПользователя - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеПользователяИБ(ИдентификаторПользователя) Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователя);
		Если ПользовательИБ = Неопределено Тогда
			Результат = "<Пользователь не найден>";
		Иначе
			Результат = ПользовательИБ.ПолноеИмя;
		КонецЕсли;
	Иначе
		Результат = "<...>";
	КонецЕсли;
	
	Возврат Результат;
				
КонецФункции

// Функция возвращает ключ менеджера записи регистра сведений на основе 
//	https://fastcode.im/Templates/7545
//
// Параметры:
//  ДанныеЗаписи	- РегистрСведенийМенеджерЗаписи, Структура, Произвольный - коллекция с данными записи
//  ИмяРегистра		- Строка - Имя регистра. Если не передано, то метаданные регистра берутся из ДанныеЗаписи
// 
// Возвращаемое значение:
//  РегистрСведенийКлючЗаписи - Ключ записи регистра
//
Функция КлючМенеджераЗаписиРегистраСведений(ДанныеЗаписи, ИмяРегистра = "") Экспорт
	
	Если ПустаяСтрока(ИмяРегистра) Тогда
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаписи));
	Иначе
		МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	КонецЕсли;
	
	ЗначенияКлюча = Новый Структура("Период", Неопределено);
	
	Для Каждого ОписаниеИзмерения Из МетаданныеРегистра.Измерения Цикл
		ЗначенияКлюча.Вставить(ОписаниеИзмерения.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЗначенияКлюча, ДанныеЗаписи);
	
	Возврат РегистрыСведений[МетаданныеРегистра.Имя].СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции

// Донастраивает форму списка так, чтобы она стала формой выбора.
// Позволяет полноценно использовать одну форму как в качестве основной формы списка, так и формы выбора
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - управляемая форма:
//  * Параметры - ДанныеФормыСтруктура:
//  ** РежимВыбора - Булево
//  ** МножественныйВыбор - Булево 	
//  ИмяЭлемента  - Строка - Имя элемента динамического списка
//
Процедура ИнициализироватьФормуВыбора(Форма, ИмяЭлемента = "Список") Экспорт
	
	ЭлементФормы  = Форма.Элементы.Найти(ИмяЭлемента);
	РеквизитФормы = Форма[ЭлементФормы.ПутьКДанным];//ДинамическийСписок
	
	ЭлементФормы.РежимВыбора = (Форма.Параметры.РежимВыбора = Истина);
	ЭлементФормы.МножественныйВыбор = (Форма.Параметры.МножественныйВыбор = Истина);
	
	РеквизитФормы.АвтоматическоеСохранениеПользовательскихНастроек = НЕ ЭлементФормы.РежимВыбора;

КонецПроцедуры

// Параметры открытия формы установки подмены.
// 
// Параметры:
//  ВерсияОбработки - СправочникСсылка.ВерсииПлатформенныхОбработок
//  ДляТекущегоПользователя - Булево
// 
// Возвращаемое значение:
//  Структура - Параметры открытия формы установки подмены:
// * ЗначенияЗаполнения - Структура -:
// ** ВерсияОбработки - СправочникСсылка.ВерсииПлатформенныхОбработок
// ** Использование - Булево
// * Модифицированность - Булево
Функция ПараметрыОткрытияФормыУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВерсияОбработки", ВерсияОбработки);
	ЗначенияЗаполнения.Вставить("Использование"  , Истина);
	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("Модифицированность", Истина);
	
	ПараметрыЗаписи = Новый Структура;
	Если ДляТекущегоПользователя Тогда
		ПараметрыЗаписи.Вставить("Владелец", ИдентификаторТекущегоПользователяИБ());
	КонецЕсли;
	ПараметрыЗаписи.Вставить("Обработка", ЗначениеРеквизитаОбъекта(ВерсияОбработки, "Владелец"));

	МенеджерЗаписи = РегистрыСведений.ПодменаПлатформенныхОбработок.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		ПараметрыФормы.Вставить("Ключ", КлючМенеджераЗаписиРегистраСведений(МенеджерЗаписи));
	Иначе
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			ТекущийКлюч = КлючИЗначение.Ключ; //Строка
			ЗначенияЗаполнения.Вставить(ТекущийКлюч, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

// Подсистема существует БСП.
// 
// Параметры:
//  ПолноеИмяПодсистемы - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ПодсистемаСуществуетБСП(ПолноеИмяПодсистемы) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения") <> Неопределено Тогда
		
		//@skip-check empty-except-statement
		Попытка
			УстановитьБезопасныйРежим(Истина);
			Возврат Вычислить("ОбщегоНазначения.ПодсистемаСуществует(ПолноеИмяПодсистемы)");
		Исключение
			//Предполагаем, что это не БСП
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Подсистема существует БСП - Пользователи.
// 
// Возвращаемое значение:
//  Булево
Функция ПодсистемаСуществуетБСП_Пользователи() Экспорт
	
	Возврат ПодсистемаСуществуетБСП("СтандартныеПодсистемы.Пользователи");
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Значение реквизита объекта.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка
//  ИмяРеквизита - Строка
//  ЗначениеПоУмолчанию - Неопределено, Произвольный -
// 
// Возвращаемое значение:
//  Неопределено, Произвольный -
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ЗначениеПоУмолчанию = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ %1 ИЗ %2 ГДЕ Ссылка = &Ссылка", 
		ИмяРеквизита, Ссылка.Метаданные().ПолноеИмя());
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка[0];
	КонецЕсли;
	
КонецФункции

// Создать версию обработки.
// 
// Параметры:
//  ДанныеВерсии - ВыборкаИзРезультатаЗапроса - Данные версии:
//  *Обработка - СправочникСсылка.ПлатформенныеОбработки
//  *ПолныйПуть - Строка
//  *КлючевоеИмя - Строка
//  ВерсияПриложения - Строка - Версия приложения
Процедура СоздатьВерсиюОбработки(ДанныеВерсии, ВерсияПриложения)
	
	ЭлементВерсии = Справочники.ВерсииПлатформенныхОбработок.СоздатьЭлемент();
	ЭлементВерсии.Владелец = ДанныеВерсии.Обработка;
	ЭлементВерсии.ВерсияПриложения = ВерсияПриложения;
	ЭлементВерсии.Наименование = СтрШаблон("%1 (Оригинальная версия %2)", ДанныеВерсии.Обработка, ВерсияПриложения);
	
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".epf");
	
	Попытка
		
		КопироватьФайл(ДанныеВерсии.ПолныйПуть, ИмяВременногоФайла);
		ЭлементВерсии.ДанныеВерсии = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяВременногоФайла));
		ЭлементВерсии.ДополнительныеСвойства.Вставить("СлужебноеОбновление", Истина);
		ЭлементВерсии.КлючевоеИмя = ДанныеВерсии.КлючевоеИмя;
		ЭлементВерсии.Записать();
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ПричинаОшибки  = "Ресурс не найден";
		СообщитьОшибку = Истина;
		Если СтрНайти(ОписаниеОшибки, ПричинаОшибки) > 0 Тогда
			ОписаниеОшибки = ПричинаОшибки;
			СообщитьОшибку = Ложь;
		КонецЕсли;
		
		ТекстОшибки = "Не удалось создать версию обработки %1 по причине: %2";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеВерсии.Обработка, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации("УправлениеПлатформеннымиОбработками.СозданиеВерсииОбработки", 
		УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ВерсииПлатформенныхОбработок, , ТекстОшибки);
		
		Если СообщитьОшибку Тогда
			УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецПопытки;
	
	УдалитьФайлы(ИмяВременногоФайла);
		
КонецПроцедуры

// Возвращает пустой уникальный идентфикатор.
//
// Возвращаемое значение:
//  УникальныйИдентификатор - уникальный идентификатор.
//
Функция ПустойУникальныйИдентификатор() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

#КонецОбласти
