// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Перед началом работы системы.
Процедура ПередНачаломРаботыСистемы() Экспорт

	Попытка
		УправлениеПлатформеннымиОбработками.ОбновитьПлатформенныеОбработкиПриСменеВерсииПриложения();
	Исключение
		ДобавитьОшибкуВЖурнал(ИнформацияОбОшибке());
	КонецПопытки;
	
	Попытка
		УправлениеПлатформеннымиОбработками.ПодменитьПлатформенныеОбработкиПередЗапускомСистемы();
	Исключение
		ДобавитьОшибкуВЖурнал(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Обновить платформенные обработки.
Процедура ОбновитьПлатформенныеОбработки() Экспорт
	
	УправлениеПлатформеннымиОбработками.ОбновитьПлатформенныеОбработки();
	
КонецПроцедуры

// см. УправлениеПлатформеннымиОбработками.ПодключитьВерсиюОбработки
Процедура ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя = "") Экспорт
	
	УправлениеПлатформеннымиОбработками.ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя);
	
КонецПроцедуры

// см. УправлениеПлатформеннымиОбработками.ПараметрыОткрытияФормыУстановкиПодмены
Функция ПараметрыОткрытияФормыУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ПараметрыОткрытияФормыУстановкиПодмены(
		ВерсияОбработки, ДляТекущегоПользователя);
	
КонецФункции

// см. УправлениеПлатформеннымиОбработками.ИдентификаторТекущегоПользователяИБ
Функция ИдентификаторТекущегоПользователяИБ() Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ИдентификаторТекущегоПользователяИБ();
	
КонецФункции

// см. УправлениеПлатформеннымиОбработками.ДвоичныеДанныеВерсии
Функция ДвоичныеДанныеВерсии(Версия) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ДвоичныеДанныеВерсии(Версия);
	
КонецФункции

// см. УправлениеПлатформеннымиОбработками.ЭтоОригинальнаяВерсия
Функция ЭтоОригинальнаяВерсия(Версия) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ЭтоОригинальнаяВерсия(Версия);
	
КонецФункции

// см. УправлениеПлатформеннымиОбработками.УдалитьВсеДанныеПодсистемы
Процедура УдалитьВсеДанныеПодсистемы() Экспорт
	
	УправлениеПлатформеннымиОбработками.УдалитьВсеДанныеПодсистемы();
	
КонецПроцедуры

// Добавить ошибку в журнал и вывести пользователю.
// 
// Параметры:
//  ИнформацияОбОшибке - Строка, ИнформацияОбОшибке - Информация об ошибке
//  СообщитьПользователю - Булево - Сообщать ли пользователю
Процедура ДобавитьОшибкуВЖурнал(ИнформацияОбОшибке, СообщитьПользователю = Истина) Экспорт
	
	СообщениеВЖурнал = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ЗаписьЖурналаРегистрации(Метаданные.Подсистемы.УправлениеПлатфомреннымиОбработками.Имя, 
		УровеньЖурналаРегистрации.Ошибка, , , СообщениеВЖурнал);
	
	Если СообщитьПользователю Тогда
		СообщениеПользователю = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(СообщениеПользователю);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
