// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Перед началом работы системы.
Процедура ПередНачаломРаботыСистемы() Экспорт

	Попытка
		УправлениеПлатформеннымиОбработками.ОбновитьПлатформенныеОбработкиПриСменеВерсииПриложения();
	Исключение
		УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		УправлениеПлатформеннымиОбработками.ПодменитьПлатформенныеОбработкиПередЗапускомСистемы();
	Исключение
	    УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Обновить платформенные обработки.
Процедура ОбновитьПлатформенныеОбработки() Экспорт
	
	УправлениеПлатформеннымиОбработками.ОбновитьПлатформенныеОбработки();
	
КонецПроцедуры

// см. УправлениеПлатформеннымиОбработками.ПодключитьВерсиюОбработки
Процедура ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя = "") Экспорт
	
	УправлениеПлатформеннымиОбработками.ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя);
	
КонецПроцедуры

// см. УправлениеПлатформеннымиОбработками.ПараметрыОткрытияФормыУстановкиПодмены
Функция ПараметрыОткрытияФормыУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ПараметрыОткрытияФормыУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя);
	
КонецФункции

// см. УправлениеПлатформеннымиОбработками.ИдентификаторТекущегоПользователяИБ
Функция ИдентификаторТекущегоПользователяИБ() Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ИдентификаторТекущегоПользователяИБ();
	
КонецФункции

//см. УправлениеПлатформеннымиОбработками.ДвоичныеДанныеВерсии
Функция ДвоичныеДанныеВерсии(Версия) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ДвоичныеДанныеВерсии(Версия);
	
КонецФункции

//см. УправлениеПлатформеннымиОбработками.ЭтоОригинальнаяВерсия
Функция ЭтоОригинальнаяВерсия(Версия) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ЭтоОригинальнаяВерсия(Версия);
	
КонецФункции

#КонецОбласти
