
#Область ПрограммныйИнтерфейс
 
// Версия приложения.
// 
// Возвращаемое значение:
//  Строка - Версия приложения
Функция ВерсияПриложения() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ВерсияПриложения;
	
КонецФункции

// Сообщить пользователю.
// 
// Параметры:
//  ТекстСообщенияПользователю - Строка
Процедура СообщитьПользователю(ТекстСообщенияПользователю) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
