// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
    Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПолныеПути();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПолныеПути()
	
	МенеджерПлатформенныхОбработок = УправлениеПлатформеннымиОбработками.МенеджерПлатформенныхОбработок();
	Для каждого ТекущиеДанные Из ИменаПодключения Цикл
		ТекущиеДанные.ПолныйПуть = МенеджерПлатформенныхОбработок.ПолныйПутьПлатформеннойОбработки(
			ТекущиеДанные.КлючевоеИмя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли