
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВерсииПлатформенныхОбработок") Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ДанныеЗаполнения;
	
	РеквизитыРодителя = "Владелец,Владелец.Наименование,ВерсияПриложения,Родитель,ДанныеВерсии,КлючевоеИмя";
	РеквизитыРодителя = УправлениеПлатформеннымиОбработками.ЗначенияРеквизитовОбъекта(Родитель, РеквизитыРодителя);
	Если ЗначениеЗаполнено(РеквизитыРодителя.Родитель) Тогда
		Родитель = РеквизитыРодителя.Родитель;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыРодителя, "ДанныеВерсии,Владелец,ВерсияПриложения,КлючевоеИмя");
	
	Наименование = СтрШаблон("%1 (исправленная версия %2)", РеквизитыРодителя.ВладелецНаименование, ВерсияПриложения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли