
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Модифицированность") Тогда
		Модифицированность = Параметры.Модифицированность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Владелец) 
		ИЛИ Запись.Владелец = УправлениеПлатформеннымиОбработкамиВызовСервера.ТекущийПользователь() Тогда
		
		УправлениеПлатформеннымиОбработкамиКлиент.СпроситьИПодключитьВерсиюОбработкиДляТекущегоСеанса(Запись.ВерсияОбработки);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
