
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОригинальнаяВерсия = УправлениеПлатформеннымиОбработкамиВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Родитель");
	Если НЕ ЗначениеЗаполнено(ОригинальнаяВерсия) Тогда
		ПоказатьПредупреждение(, "Нельзя изменять оригинальную версию обработки");
		Возврат;
	КонецЕсли;
	
	ВыбратьФайлИЗагрузить(ПараметрКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлИЗагрузить(ВерсияИлиФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ВерсияИлиФайлы) = Тип("СправочникСсылка.ВерсииПлатформенныхОбработок") Тогда
		
		ДиалогВыбораФайла       = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Фильтр = "Обработка (*.epf)|*.epf";
		ДополнительныеПараметры = ВерсияИлиФайлы;
		ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыбратьФайлИЗагрузить", ЭтотОбъект, ДополнительныеПараметры));
		
	ИначеЕсли ТипЗнч(ВерсияИлиФайлы) = Тип("Массив") И ЗначениеЗаполнено(ВерсияИлиФайлы) Тогда
		
		ИмяФайла    = ВерсияИлиФайлы[0];
		ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
		
		ЗаписатьДанныеВерсии(ДополнительныеПараметры, ДанныеФайла);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВерсии(ВерсияОбъекта, ДанныеВерсии)
	
	Объект = ВерсияОбъекта.ПолучитьОбъект();
	Объект.ДанныеВерсии = Новый ХранилищеЗначения(ДанныеВерсии);
	Объект.Записать();
	
КонецПроцедуры
