// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.УстановитьОграниченияИспользованияВОтборе(СтрРазделить("Владелец", ","));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// Список при получении данных на сервере.
// 
// Параметры:
//  ИмяЭлемента - Строка -  Имя элемента
//  Настройки - НастройкиКомпоновкиДанных -  Настройки :
//  * ДополнительныеСвойства - Структура -:
//  ** ПодсистемаБСП - Булево
//  Строки - СтрокиДинамическогоСписка - Баг ЕДТ не понимает строки ДС:
//  * Значение - СтрокаДинамическогоСписка - :
//  ** Данные - ДанныеФормыСтруктура - :
//  *** Владелец - Строка
//  *** Владелец - УникальныйИдентификатор
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	УПО_Сервер.СписокПодменыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);

КонецПроцедуры

#КонецОбласти
