// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗадатьВопросПередУдалением();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Задать вопрос перед удалением.
// 
// Параметры:
//  РезультатВопроса - Неопределено
//                   - КодВозвратаДиалога
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ЗадатьВопросПередУдалением(РезультатВопроса = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗадатьВопросПередУдалением", ЭтотОбъект, ДополнительныеПараметры), 
		"Все данные подсистемы управления платформенными обработками БУДУТ УДАЛЕНЫ. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		УдалитьВсеДанныеПодсистемы();
		УправлениеПлатформеннымиОбработкамиКлиент.ОповеститьОбИзмененииДанныхПодсистемы();
		
	КонецЕсли;
	
КонецПроцедуры

// Удалить все данные подсистемы.
&НаСервере
Процедура УдалитьВсеДанныеПодсистемы()
	
	УправлениеПлатформеннымиОбработками.УдалитьВсеДанныеПодсистемы();
	
КонецПроцедуры

#КонецОбласти

