
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗадатьВопросПередУдалением();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПередУдалением(РезультатВопроса = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗадатьВопросПередУдалением", ЭтотОбъект, ДополнительныеПараметры), 
		"Все данные подсистемы управления платформенными обработками БУДУТ УДАЛЕНЫ. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		УдалитьВсеДанныеПодсистемы();
		УправлениеПлатформеннымиОбработкамиКлиент.ОповеститьОбИзмененииДанныхПодсистемы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеДанныеПодсистемы()
	
	УправлениеПлатформеннымиОбработками.УдалитьВсеДанныеПодсистемы();
	
КонецПроцедуры

