
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломРаботыСистемы() Экспорт
	
	УправлениеПлатформеннымиОбработкамиВызовСервера.ПередНачаломРаботыСистемы();
	
КонецПроцедуры

Процедура ОткрытьФормуУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя) Экспорт
	
	ПараметрыФормы = УправлениеПлатформеннымиОбработкамиВызовСервера.ПараметрыОткрытияФормыУстановкиПодмены(
	ВерсияОбработки, ДляТекущегоПользователя);
	
	ОткрытьФорму("РегистрСведений.ПодменаПлатформенныхОбработок.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

Процедура СпроситьИПодключитьВерсиюОбработкиДляТекущегоСеанса(ВерсияИлиОтвет = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ВерсияИлиОтвет) = Тип("СправочникСсылка.ВерсииПлатформенныхОбработок") Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВерсияОбработки", ВерсияИлиОтвет);
		
		ОбработчикОповещения = Новый ОписаниеОповещения("СпроситьИПодключитьВерсиюОбработкиДляТекущегоСеанса", 
		УправлениеПлатформеннымиОбработкамиКлиент, ДополнительныеПараметры);
		
		ТекстВопроса = "Подключить версию обработки для текущего сеанса?";
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли ВерсияИлиОтвет = КодВозвратаДиалога.Да Тогда
		
		УправлениеПлатформеннымиОбработкамиВызовСервера.ПодключитьВерсиюОбработки(ДополнительныеПараметры.ВерсияОбработки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбИзмененииДанныхПодсистемы() Экспорт
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ПлатформенныеОбработки"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.ВерсииПлатформенныхОбработок"));
	
КонецПроцедуры

#КонецОбласти
