
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыбратьФайлИСохранить(ПараметрКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлИСохранить(ВерсияИлиФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ВерсияИлиФайлы) = Тип("СправочникСсылка.ВерсииПлатформенныхОбработок") Тогда
		
		ДиалогВыбораФайла       = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Фильтр = "Обработка (*.epf)|*.epf";
		ДиалогВыбораФайла.ПолноеИмяФайла = СтрШаблон("%1.epf", ВерсияИлиФайлы);
		ДополнительныеПараметры = ВерсияИлиФайлы;
		ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыбратьФайлИСохранить", ЭтотОбъект, ДополнительныеПараметры));
		
	ИначеЕсли ТипЗнч(ВерсияИлиФайлы) = Тип("Массив") И ЗначениеЗаполнено(ВерсияИлиФайлы) Тогда
		
		ИмяФайла    = ВерсияИлиФайлы[0];
		ДанныеФайла = ДвоичныеДанныеВерсии(ДополнительныеПараметры);
		Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
			ДанныеФайла.Записать(ИмяФайла);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеВерсии(Версия)
	
	ДанныеФайла = УправлениеПлатформеннымиОбработками.ЗначениеРеквизитаОбъекта(Версия, "ДанныеВерсии");
	
	Возврат ДанныеФайла.Получить();
	
КонецФункции

