
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломРаботыСистемы() Экспорт

	Попытка
		УправлениеПлатформеннымиОбработками.ОбновитьПлатформенныеОбработкиПриСменеВерсииПриложения();
	Исключение
		УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		УправлениеПлатформеннымиОбработками.ПодменитьПлатформенныеОбработкиПередЗапускомСистемы();
	Исключение
	    УправлениеПлатформеннымиОбработкамиКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьПлатформенныеОбработки() Экспорт
	
	УправлениеПлатформеннымиОбработками.ОбновитьПлатформенныеОбработки();
	
КонецПроцедуры

Процедура ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя = "") Экспорт
	
	УправлениеПлатформеннымиОбработками.ПодключитьВерсиюОбработки(ВерсияОбработки, КлючевоеИмя);
	
КонецПроцедуры

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
	
КонецФункции

Функция ПараметрыОткрытияФормыУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя) Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ПараметрыОткрытияФормыУстановкиПодмены(ВерсияОбработки, ДляТекущегоПользователя);
	
КонецФункции

Функция ТекущийПользователь() Экспорт
	
	Возврат УправлениеПлатформеннымиОбработками.ТекущийПользователь();
	
КонецФункции

#КонецОбласти
