// @strict-types

#Область ОбработчикиСобытийФормы
 
// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходящаяМодифицированность = Ложь;
	Если Параметры.Свойство("Модифицированность", ВходящаяМодифицированность) Тогда
		Модифицированность = ВходящаяМодифицированность;
	КонецЕсли;
	
КонецПроцедуры

// После записи.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - Параметры записи
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Владелец) 
		ИЛИ Запись.Владелец = УправлениеПлатформеннымиОбработкамиВызовСервера.ТекущийПользователь() Тогда
		
		УправлениеПлатформеннымиОбработкамиКлиент.СпроситьИПодключитьВерсиюОбработкиДляТекущегоСеанса(Запись.ВерсияОбработки);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
